# -*- coding: utf-8 -*-
#+OPTIONS:   TeX:t skip:nil d:nil todo:t pri:nil tags:nil toc:nil
#+begin_export html
---
layout: chapter
more: main page
title: From the shell to a program
author: Juan Reyero
excerpt: Programming is a natural way of having a conversation with the computer.  In this chapter you'll write your first programs, and will understand how the computer expects to be told what to do when you are not looking.
keywords: UNIX programming scripts scripting shell bash
prev-title: The way of the editor
prev-url: editor.html
next-title: Speaking Python
next-url: speaking-python.html
toc: |
  <ul class="org-ul toc">
  <li><a href="#sec-1-1">Our first program</a></li>
  <li><a href="#sec-1-2">Running the program</a></li>
  <li><a href="#sec-1-3">Program permissions</a></li>
  <li><a href="#sec-1-4">Variables in the shell</a></li>
  <li><a href="#sec-1-5">Sourcing scripts</a></li>
  <li><a href="#sec-1-6">Environment variables</a></li>
  <li><a href="#sec-1-7">Initializing environment variables</a></li>
  <li><a href="#sec-1-8">Conditionals in the shell</a></li>
  <li><a href="#sec-1-9">Looping the shell</a></li>
  <li><a href="#sec-1-10">Programming and the shell</a></li>
  </ul>
---
#+end_export

#+begin_src sh :results silent :exports none
  export HOME=/Users/inesuka
  unset http_proxy
  unset https_proxy
  cd
  rm -rf tmp
  rm -rf changek/bootstrap
  rm -rf testdir
  unalias rm
  unalias cp
  unalias mv
  alias ls="ls -p"
#+end_src

** Running the program
:PROPERTIES:
:ID:       1750CE93-B64F-4249-A407-51826FA86053
:END:

There are a three ways to do it, and it is very important that you understand them well.

The clearest way to run a program is explicitly: ask a shell to run it.  Try this on your terminal:

#+begin_src sh :results none :exports source
 bash shelltest.sh
#+end_src

By typing =bash= in the command line you are executing another =bash= within the terminal's =bash=.  It may sound like a puzzle, but remember that the program that you are talking to when in the terminal is the shell =bash=.  And that =bash= is a program, like any other, so you can call it whenever you wish, running it like any other program.

Take some time now and do a quick experiment  to convince yourself.  First take a look at where you are in your terminal:

#+begin_src sh
  pwd
#+end_src

#+RESULTS:
: /Users/inesuka

Now run another instance of =bash=,

#+begin_src sh :results none
  bash
#+end_src

You are now in an instance of the shell that runs under your initial shell.  Try, for example, to move to another directory,

#+begin_src sh
  cd /
  pwd
#+end_src

#+RESULTS:
:
: /

This instance of bash is now at the root directory.  Exit it,

#+begin_src sh :results none
  exit
#+end_src

and now check again where you are,

#+begin_src sh
  pwd
#+end_src

#+RESULTS:
: /Users/inesuka

Indeed.  The parent shell, the one you were running before your call to =bash=, does not know that in the other shell you have moved to another directory.

When you execute =bash= passing it a text file as an argument --- /your/ program ---, as you did just a moment ago, it will execute one by one the commands in the text file, then exit.  When it exits you will be standing in the original shell.

You have seen the output of the =wc= command.  To further convince yourself that the program did what it was supposed to, take a look at the file it created:

#+begin_src sh
  cat testdir/first.txt
#+end_src

#+RESULTS:
: My first file made by a program

Bingo!  It did create the file with the expected content.

You can usually call the shell with the shorter name =sh=,

#+begin_src sh :results none :exports source
 sh shelltest.sh
#+end_src

** Variables in the shell
:PROPERTIES:
:ID:       B0BAEBB5-C424-41A2-A0DD-EFE55B826B8C
:END:

Before we look into the third way to run a shell program let me tell you about variables.  They are one of the tricks that simplify programming.  Look at the program we just wrote:

#+begin_src sh :results none :exports source
  mkdir testdir
  cd testdir
  echo "My first file made by a program" > first.txt
  wc -w first.txt
  cd ..
#+end_src

We are using =first.txt= twice: first when we create it, second when we count how many words it contains.  Imagine that we wanted to change it to another file name: we would have to change it in two places.  Which doesn't sound like a big deal, but if the program was large it would quickly become a burden and a source of errors.

Defining a variable is choosing a name for a value, a name that we'll be able to use to refer to the value.  Let's pick =FILE=, which will remind us of what the variable is a name for.  We define the variable by /assigning/ to it, and we assign using the === sign.  When we write

: FILE=first.txt

we are saying that, from now on, the name for =first.txt= will be =FILE=.  Or, in more conventional words, we have assigned the value =first.txt= to the variable =FILE=.  In order to access the variable's value we prepend it with =$=, as in =$FILE=.  Variables are a common feature to most programming languages, but the =$= prepended at the beginning is a quirk of the shell.

Try it out first directly in the shell.  Store something in a variable,

#+begin_src sh :results none
  days=365
#+end_src

#+RESULTS:

then access it,

#+begin_src sh
  echo $days
#+end_src

#+RESULTS:
: 365

Now let's modify our program so that it uses a =FILE= variable,

#+begin_src sh :results none :exports source
  FILE=first.txt
  echo "Using $FILE for test"
  mkdir testdir
  cd testdir
  echo "My first file made by a program" > $FILE
  wc -w $FILE
  cd ..
#+end_src

We have added a line that echoes the current value of =FILE=, just for fun.  Note that now, if we want to modify the file name, we just have to change in one place: where we assign it to the =FILE= variable.

The next thing we would naturally want to do is to set the file name as a command line argument.  All languages have a method to do that; in the shell, this is such a common thing to do that it is very easy.  You just use =$1= for the first argument, =$2= for the second, etc.  This is how it looks like:

#+begin_src sh :results none :exports source
  FILE=$1
  echo "Using $FILE for test"
  mkdir testdir
  cd testdir
  echo "My first file made by a program" > $FILE
  wc -w $FILE
  cd ..
#+end_src

Now you can call your program with

: ./shelltest.sh filename

** Environment variables
:PROPERTIES:
:ID:       8041E89C-AA38-447F-B4D5-2F25449E9197
:END:

What if you want your shell's variables to be available to the shells you spawn?  That is, imagine that you want to define a variable that the programs you call will be able to see and use.  You do that by exporting it, as in:

#+begin_src sh :results none :exports source
  export ME=yourname
#+end_src

Now you can write a program that uses the =ME= variable.  For example, in a file =greet.sh= write

#+begin_src sh :results none :exports source
  echo "Good morning, $ME"
#+end_src

and run it with

#+begin_src sh :results none :exports source
 sh greet.sh
#+end_src

#+begin_src sh :exports results
  echo "Good morning, $ME"
#+end_src

#+RESULTS:
: Good morning, yourname

The variables that have been exported from your shell are called environment variables.  A particularly important one is =PATH=, a variable containing all the directories in which to look for executable programs, separated by colons.

** Looping the shell
:PROPERTIES:
:ID:       520442DF-CFF3-4451-BB58-728511454285
:END:

Loops ---the ability to repeat something many times--- are another feature found in most programming languages.  Try this out, directly on the shell:

#+begin_src sh
  for i in 1 2 3 4 5
  do
     echo "Now i is $i"
  done
#+end_src

#+RESULTS:
: Now i is 1
: Now i is 2
: Now i is 3
: Now i is 4
: Now i is 5

You can specify a range with

#+begin_src sh
  for i in {1..10}
  do
     echo "Now i is $i"
  done
#+end_src

#+RESULTS:
#+begin_example
Now i is 1
Now i is 2
Now i is 3
Now i is 4
Now i is 5
Now i is 6
Now i is 7
Now i is 8
Now i is 9
Now i is 10
#+end_example

Now look at this version of your program, and see if you can figure out what it will do before trying it out:

#+begin_src sh :results none :exports source
  if [ "$1" != "" ]; then
      FILE=$1
  else
      FILE=first.txt
  fi

  echo "Using $FILE for test"
  mkdir testdir
  cd testdir

  # This will have the effect of starting the file afresh,
  # so that later we can append to it without worrying about
  # previous runs of the program having already started the
  # file.
  echo "" > $FILE

  for i in {1..20}
  do
      echo "The line $i" >> $FILE
  done
  wc -w $FILE
  cd ..
#+end_src

